# фрагмент А

#  first = "2"
#  second = "3"
#  print(first + second)

# требуется сумма чисел 5, а не соединение строк 23

# (first + second) соединит две строки, а желаемый результат предполагает сложение чисел, поэтому внутри print() поставил каждый аргумент в int()
# чтобы складывались целые числа, а не строки

first = "6"  # строка
second = "8"  # строка
print(int(first) + int(second))  # целое число

# результат: 5

# фрагмент Б

#  age = input("Возраст: ")
#  print(age + 1)

# аргумент age может быть любым типом данных, помимо чисел, поэтому, чтобы программа работала корректно, добавил input() внутрь int(), чтобы 
# вводимые данные сразу были целыми числами и сложение внутри print() происходило без ошибок. (надеюсь люди догадаются что возраст обычно пишут целым числом а не буквами)

# требуется возраст через год. Ввод для проверки — 17

age = int(input("Возраст: "))  # целое число
print(age + 5)  # целое число

# результат: 18

# фрагмент В

#  first = 4
#  second = 7
#  third = 10
#  average = first + second + third / 3
#  print(average) 

# требуется среднее трёх чисел 4, 7, 10; правильный результат — 7.0

# python выполняет действия сложения или умножения в арифметическом порядке, а значит деление выполнится первым, а затем пойдёт сложение, чтобы исправить
# ошибку надо просто взять то, что складывается, в скобки, чтобы потом вся сумма делилась на 3, а не только последний аргумент third 

first = 16
second = 8
third = 10
average = (first + second + third) / 3
print(average)

# результат: 7.0
